Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI] allows you to run your lambdas locally on your laptop in a simulated Lambda environment. This requires https://www.docker.com/products/docker-desktop[docker] to be installed. This is an optional approach should you choose to take advantage of it. Otherwise, the Quarkus JUnit integration should be sufficient for most of your needs.
ja_jp: link:https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI] を利用すると、Lambda をシミュレートした環境でラップトップ上のローカルで Lambda を実行することができます。これには link:https://www.docker.com/products/docker-desktop[docker] のインストールが必要です。これは、利用することを選択した場合のオプションのアプローチです。それ以外の場合は、Quarkus JUnitの統合でほとんどのニーズを満たすことができるはずです。

source: The https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html[AMQP Type System] defines the supported types.
ja_jp: https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html[AMQP Type System] は、サポートされるタイプを定義します。

source: The https://docs.quarkiverse.io/quarkus-micrometer-registry/dev/micrometer-registry-otlp.html[Quarkiverse Micrometer OTLP registry] will output data using the OpenTelemetry OTLP protocol to the Grafana LGTM Dev Service. This will *push* data out of the service:
ja_jp: https://docs.quarkiverse.io/quarkus-micrometer-registry/dev/micrometer-registry-otlp.html[Quarkiverse Micrometer OTLP レジストリー] は、OpenTelemetry OTLP プロトコルを使用してデータを Grafana LGTM Dev Service に出力します。これにより、データがサービスから *プッシュ* されます。

source: The https://docs.quarkiverse.io/quarkus-web-bundler/dev/[Quarkus Web Bundler] is also a good approach, it is closer to the Java ecosystem and removes a lot of boilerplate and configuration, it is fast and efficient. For examples of such SPAs, see https://github.com/quarkusio/code.quarkus.io[code.quarkus.io] and https://github.com/mvnpm/mvnpm[mvnpm.org].
ja_jp: https://docs.quarkiverse.io/quarkus-web-bundler/dev/[Quarkus Web Bundler]。こちらも適切なアプローチです。Java エコシステムに近いため、多くのボイラープレートや設定が不要になり、高速かつ効率的です。このような SPA の例については、 https://github.com/quarkusio/code.quarkus.io[code.quarkus.io] および https://github.com/mvnpm/mvnpm[mvnpm.org] を参照してください。

source: The https://github.com/open-telemetry/opentelemetry-java-instrumentation/tree/main/instrumentation/jdbc/library[JDBC instrumentation] bundled with this extension will add a span for each JDBC queries done by your application.
ja_jp: このエクステンションにバンドルされている https://github.com/open-telemetry/opentelemetry-java-instrumentation/tree/main/instrumentation/jdbc/library[JDBC 計装] は、アプリケーションによって行われる各 JDBC クエリーに対してスパンを追加します。

source: The https://github.com/open-telemetry/opentelemetry-java-instrumentation/tree/main/instrumentation/jdbc/library[JDBC instrumentation] will add a span for each JDBC queries done by your application, to enable it, add the following dependency to your build file:
ja_jp: link:https://github.com/open-telemetry/opentelemetry-java-instrumentation/tree/main/instrumentation/jdbc/library[JDBCインスツルメンテーション]は、アプリケーションによって実行される各JDBCクエリのためにスパンを追加します。これを有効にするには、次の依存関係をビルドファイルに追加します。

source: The https://github.com/opentracing-contrib/java-jdbc[JDBC instrumentation] will add a span for each JDBC queries done by your application, to enable it, add the following dependency to your build file:
ja_jp: link:https://github.com/opentracing-contrib/java-jdbc[JDBC Instrumentation] は 、アプリケーションが実行するJDBCクエリごとにスパンを追加します。これを有効にするには、ビルドファイルに次の依存関係を追加します:

source: The https://github.com/opentracing-contrib/java-kafka-client[Kafka instrumentation] will add a span for each message sent to or received from a Kafka topic. To enable it, add the following dependency to your build file:
ja_jp: link:https://github.com/opentracing-contrib/java-kafka-client[Kafka instrumentation] は、Kafka トピックとの間で送受信されるメッセージごとにスパンを追加します。これを有効にするには、ビルドファイルに以下の依存関係を追加します:

source: The https://github.com/opentracing-contrib/java-mongo-driver[Mongo Driver instrumentation] will add a span for each command executed by your application. To enable it, add the following dependency to your build file:
ja_jp: link:https://github.com/opentracing-contrib/java-mongo-driver[Mongo Driver instrumentation] は 、アプリケーションが実行するコマンドごとにスパンを追加します。これを有効にするには、ビルドファイルに次の依存関係を追加します:

source: The https://github.com/opentracing-contrib[OpenTracing API Contributions project] offers additional instrumentation that can be used to add tracing to a large variety of technologies/components.
ja_jp: link:https://github.com/opentracing-contrib[OpenTracing API Contributionsプロジェクト] では、様々な技術/コンポーネントにトレースを追加するために使用できる追加の計器 (Instrumentation) を提供しています。

source: The https://github.com/orgs/quarkusio/projects/49[working group for Dev Services lifecycle] is still underway, and welcomes contributions.
ja_jp: https://github.com/orgs/quarkusio/projects/49[Dev Services ライフサイクルのワーキンググループ] は現在も進行中であり、貢献を歓迎しています。

source: The https://github.com/quarkiverse/quarkus-mailpit[Quarkus Mailpit] extension is very handy for testing emails. It provides Dev Services for https://github.com/axllent/mailpit[Mailpit], a nice UI for testing and debugging email sending.
ja_jp: link:https://github.com/quarkiverse/quarkus-mailpit[QuarkusのMailpit] エクステンションは、メールのテストに非常に便利です。 メール送信のテストやデバッグのための優れたUIである、 link:https://github.com/axllent/mailpit[Mailpit] 用のDev Servicesを提供します。

source: The https://github.com/quarkusio/quarkus-super-heroes/tree/main/deploy/k8s[`+deploy/k8s+`^] directory in the https://github.com/quarkusio/quarkus-super-heroes[root of the respository^] contains Kubernetes descriptors for each of the four versions of the application: JVM 11, JVM 17, native built with Java 11, and native built with Java 17.
ja_jp: レスポンダのルートにある link:https://github.com/quarkusio/quarkus-super-heroes/tree/main/deploy/k8s[`deploy/k8s`, window=_blank] link:https://github.com/quarkusio/quarkus-super-heroes[respositoryのルート, window=_blank]にあるディレクトリには、アプリケーションの4つのバージョンそれぞれのKubernetesディスクリプターが含まれています。JVM 11、JVM 17、Java 11で構築されたネイティブ、Java 17で構築されたネイティブの4つのバージョンのKubernetesディスクリプターが含まれています。

source: The https://github.com/quarkusio/quarkus-super-heroes/tree/main/scripts[`+scripts+`^] directory contains a https://github.com/quarkusio/quarkus-super-heroes/blob/main/scripts/watch-services.sh[`+watch-services.sh+`^] script that can be run in a separate terminal. This script will watch the startup of all the services and report when they are all up and ready.
ja_jp: link:https://github.com/quarkusio/quarkus-super-heroes/tree/main/scripts[`scripts`, window=_blank]ディレクトリには link:https://github.com/quarkusio/quarkus-super-heroes/blob/main/scripts/watch-services.sh[`watch-services.sh`, window=_blank]スクリプトが含まれており、別のターミナルで実行することができます。このスクリプトは、すべてのサービスの起動を監視し、すべてのサービスが起動して準備が整ったら報告します。

source: The https://github.com/quarkusio/quarkus/blob/main/extensions/resteasy-reactive/quarkus-resteasy-reactive-qute/runtime/src/main/resources/META-INF/quarkus-extension.yaml#L18[extension metadata, window="_blank"] references the artifact containing all the core codestarts.
ja_jp: https://github.com/quarkusio/quarkus/blob/main/extensions/resteasy-reactive/quarkus-resteasy-reactive-qute/runtime/src/main/resources/META-INF/quarkus-extension.yaml#L18[エクステンションメタデータ, window="_blank"] は、すべてのコア Codestart を含むアーティファクトを参照します。

source: The https://github.com/quarkusio/quarkus/blob/main/extensions/resteasy-reactive/rest-qute/runtime/src/main/resources/META-INF/quarkus-extension.yaml#L18[extension metadata, window="_blank"] references the artifact containing all the core codestarts.
ja_jp: link:https://github.com/quarkusio/quarkus/blob/main/extensions/resteasy-reactive/rest-qute/runtime/src/main/resources/META-INF/quarkus-extension.yaml#L18[エクステンションメタデータ, window="_blank"] は、すべてのコア・コードスタートを含むアーティファクトを参照します。

source: The https://github.com/quarkusio/quarkus/blob/main/integration-tests/devtools/src/test/java/io/quarkus/devtools/codestarts/quarkus/ConfigYamlCodestartTest.java[ ConfigYamlCodestartTest, window="_blank"] is a good example in Quarkus core.
ja_jp: link:https://github.com/quarkusio/quarkus/blob/main/integration-tests/devtools/src/test/java/io/quarkus/devtools/codestarts/quarkus/ConfigYamlCodestartTest.java[ConfigYamlCodestartTest, window=_blank]は、Quarkus coreにおける良い例です。

source: The https://github.com/quarkusio/quarkus/pull/12470[pull request description] lists the main changes.
ja_jp: link:https://github.com/quarkusio/quarkus/pull/12470[プルリクエストの説明] に主な変更点が記載されています。

source: The https://github.com/quarkusio/quarkus/tree/main/independent-projects/tools/base-codestarts/src/main/resources/codestarts/quarkus[base codestarts, window="_blank"] contains templates to create project, buildtool, languages, config & tooling files.
ja_jp: link:https://github.com/quarkusio/quarkus/tree/main/independent-projects/tools/base-codestarts/src/main/resources/codestarts/quarkus[ベース codestart, window=_blank]には、プロジェクト、ビルドツール、言語、設定、ツールの各ファイルを作成するためのテンプレートが含まれています。

source: The https://github.com/quarkusio/quarkus/tree/main/independent-projects/tools/base-codestarts/src/main/resources/codestarts/quarkus[base codestarts, window="_blank"] contains templates to create project, buildtool, languages, config and tooling files.
ja_jp: https://github.com/quarkusio/quarkus/tree/main/independent-projects/tools/base-codestarts/src/main/resources/codestarts/quarkus[ベース Codestart, window="_blank"] には、プロジェクト、ビルドツール、言語、設定、ツールファイルを作成するためのテンプレートが含まれています。

source: The https://incubator.apache.org/[Apache Incubator] is the entry point for projects, known as "podlings," seeking to join the ASF. It guides them through the adoption of meritocratic, consensus-based governance, with experienced mentors acting as liaisons between the podling and the foundation's teams. Polaris successfully completed this mentored incubation process, demonstrating both community maturity and operational readiness.
ja_jp: https://incubator.apache.org/[Apache Incubator] は、ASF への参加を目指す「ポッドリング」と呼ばれるプロジェクトのエントリーポイントです。経験豊富なメンターがポッドリングと財団のチーム間の連絡役を務め、実力主義に基づいた合意形成型のガバナンス採用を指導します。Polaris はこのメンター付きのインキュベーションプロセスを無事完了し、コミュニティの成熟度と運用準備の両方を示しました。

source: The https://jdbc.postgresql.org/documentation/head/connect.html[official documentation] go into more detail and list optional parameters as well.
ja_jp: link:https://jdbc.postgresql.org/documentation/head/connect.html[公式ドキュメント] では、より詳細な情報を紹介しており、同様にオプションのパラメーターをリストアップしています。

source: The https://opentelemetry.io/[OpenTelemetry] project from the https://www.cncf.io[Cloud Native Computing Foundation] is an initiative to merge the OpenTracing and OpenCensus projects to provide a common project for all telemetry. Tracing is the first piece of OpenTelemetry which GA'd in the last month, metrics and logging are still under development.
ja_jp: link:https://www.cncf.io[Cloud Native Computing Foundation]の link:https://opentelemetry.io/[OpenTelemetry]プロジェクトは、OpenTracing と OpenCensus プロジェクトを統合し、すべてのテレメトリのための共通プロジェクトを提供する取り組みです。Tracing は先月 GA が行われた OpenTelemetry の最初の部分で、metrics と logging はまだ開発中です。

source: The https://opentelemetry.io/docs/languages/java/api/#baggage[Baggage] can be used to send application specific data using the OpenTelemetry's propagation mechanism.
ja_jp: https://opentelemetry.io/docs/languages/java/api/#baggage[Baggage] を使用して、OpenTelemetry の伝播メカニズムを使用してアプリケーション固有のデータを送信できます。

source: The https://opentelemetry.io/docs/specs/otel/protocol/[OpenTelemetry OTLP protocol] is the recommended way to send telemetry out of a Quarkus application. This provides a unified output for the application's telemetry.
ja_jp: https://opentelemetry.io/docs/specs/otel/protocol/[OpenTelemetry OTLP プロトコル] は、Quarkus アプリケーションからテレメトリーを送信するための推奨される方法です。これにより、アプリケーションのテレメトリーの統一された出力が提供されます。

source: The https://pulsar.apache.org/docs/3.0.x/concepts-messaging/#dead-letter-topic[dead letter topic] pushes messages that are not consumed successfully to a dead letter topic an continue message consumption. Note that dead letter topic can be used in different message redelivery methods, such as acknowledgment timeout, negative acknowledgment or retry letter topic.
ja_jp: https://pulsar.apache.org/docs/3.0.x/concepts-messaging/#dead-letter-topic[デッドレタートピック] は、正常に消費されなかったメッセージをデッドレタートピックにプッシュし、メッセージの消費を継続します。 デッドレタートピックは、確認応答タイムアウト、否定応答、再試行レタートピックなどのさまざまなメッセージ再配信方法で使用できることに注意してください。

source: The https://pulsar.apache.org/docs/3.0.x/concepts-messaging/#retry-letter-topic[retry letter topic] pushes messages that are not consumed successfully to a dead letter topic and continue message consumption. Note that dead letter topic can be used in different message redelivery methods, such as acknowledgment timeout, negative acknowledgment or retry letter topic.
ja_jp: https://pulsar.apache.org/docs/3.0.x/concepts-messaging/#retry-letter-topic[再試行レタートピック] は、正常に消費されなかったメッセージをデッドレタートピックにプッシュし、メッセージの消費を継続します。 デッドレタートピックは、確認応答タイムアウト、否定応答、再試行レタートピックなどのさまざまなメッセージ再配信方法で使用できることに注意してください。

source: The https://quarkus.io/blog/march-of-ides/[IDE plugins,role=external,window=_blank] which support "Wizards w/code.quarkus.io"
ja_jp: "Wizards w/code.quarkus.io" をサポートする https://quarkus.io/blog/march-of-ides/[IDEプラグイン, role=external, window=_blank]

source: The https://quarkus.io/guides/platform[Quarkus platform] does not represent the whole Quarkus extension ecosystem, aka Quarkiverse, but rather a set of extensions that target the primary use-cases of Quarkus as a development stack. Which means that there are still plenty of Quarkus extensions that aren't present in a Quarkus platform (BOM), e.g. most of the extensions hosted on the https://github.com/quarkiverse[Quarkiverse Hub]. These non-platform extensions could still be added to Quarkus applications as usual application dependencies. The Quarkus 2.1.0.Final dev tools make it very easy, e.g.
ja_jp: link:https://quarkus.io/guides/platform[Quarkusプラットフォーム]は、Quarkusエクステンションエコシステム（Quarkiverse）全体を表すものではなく、開発スタックとしてのQuarkusの主要なユースケースを対象としたエクステンションのセットです。つまり、Quarkusプラットフォーム（BOM）に存在しないQuarkusのエクステンションはまだたくさんあります（例： link:https://github.com/quarkiverse[Quarkiverse Hub]でホストされているエクステンションのほとんど）。これらの非プラットフォームのエクステンションは、通常のアプリケーション依存関係としてQuarkusアプリケーションに追加することができます。Quarkus 2.1.0.Finalの開発ツールでは、以下のように非常に簡単に行うことができます。

source: The https://quarkus.io/guides/telemetry-micrometer[Micrometer Quarkus extension] provides metrics from automatic instrumentation implemented in Quarkus and its extensions.
ja_jp: https://quarkus.io/guides/telemetry-micrometer[Micrometer Quarkus エクステンション] は、Quarkus とそのエクステンションに実装された自動計装からのメトリクスを提供します。

source: The https://quarkus.io/guides/writing-extensions#injection[extension writing guide] says “State should only be communicated between build steps by way of build items, even if the steps are on the same class.” However, almost every Dev Service implementation broke this rule, and used a static field to track previously-created services.
ja_jp: https://quarkus.io/guides/writing-extensions#injection[エクステンション作成ガイド] には、「ビルドステップ間の状態の受け渡しは、たとえステップが同じクラス内にあっても、ビルドアイテムを介してのみ行うべきである」と記載されています。しかし、ほぼすべての Dev Service 実装がこのルールを破り、以前に作成されたサービスを追跡するために静的フィールドを使用していました。

source: The https://quarkus.io/worldtour/[Quarkus World Tour] kicked off in March to provide a unique, hands-on Quarkus experience for Java developers across the globe. The goal of the tour is to introduce Quarkus to Java developers and set them down the path of creating applications and participating in the community.
ja_jp: link:https://quarkus.io/worldtour/[Quarkus World Tour]は、世界中のJava開発者にQuarkusのユニークな実地体験を提供するために、3月にスタートしました。このツアーの目的は、Java開発者にQuarkusを紹介し、アプリケーションの作成やコミュニティへの参加への道筋をつけることです。

source: The https://redis.io/commands/[command references] explains Redis commands and contains links to reference documentation.
ja_jp: Redis コマンドを説明し、リファレンスドキュメントへのリンクが掲載されている https://redis.io/commands/[コマンドリファレンス]。

source: The https://smallrye.io/smallrye-reactive-messaging/latest/concepts/incoming-concurrency/[concurrency attribute] provides a connector agnostic way for non-blocking concurrent channels and replaces the Kafka connector specific `partitions` attribute. The `partitions` attribute is therefore deprecated and will be removed in future releases.
ja_jp: https://smallrye.io/smallrye-reactive-messaging/latest/concepts/incoming-concurrency/[concurrency 属性] は、ブロッキングしない並列チャネルのためのコネクターに依存しない方法を提供し、Kafka コネクター固有の `partitions` 属性を置き換えます。 そのため `partitions` 属性は非推奨となり、今後のリリースで削除される予定です。

source: The https://smallrye.io/smallrye-reactive-messaging/latest/concepts/observability/[message observation] depends on intercepting messages and therefore doesn't support channels consuming messages with a custom message type such as `IncomingKafkaRecord`, `KafkaRecord`, `IncomingKafkaRecordBatch` or `KafkaRecordBatch`.
ja_jp: https://smallrye.io/smallrye-reactive-messaging/latest/concepts/observability/[メッセージの監視] は メッセージのインターセプトに依存しているため、 `IncomingKafkaRecord`、 `KafkaRecord`、 `IncomingKafkaRecordBatch` または `KafkaRecordBatch` などの カスタムメッセージタイプを使用してメッセージを消費するチャネルはサポートされません。

source: The https://stedolan.github.io/jq/[jq command-line processor tool]
ja_jp: https://stedolan.github.io/jq/[jq コマンドラインプロセッサーツール]

source: The https://swagger.io/docs/specification/paths-and-operations/[Operation Id] can be set using the `@Operation` annotation, and is in many cases useful when using a tool to generate a client stub from the schema. The Operation Id is typically used for the method name in the client stub. In SmallRye, you can auto-generate this Operation Id by using the following configuration:
ja_jp: link:https://swagger.io/docs/specification/paths-and-operations/[Operation Id]は `@Operation` アノテーションを使って設定することができ、ツールを使ってスキーマからクライアント・スタブを生成する際に多くの場合役立ちます。Operation Idは通常、クライアントスタブのメソッド名に使用されます。SmallRyeでは、以下のような設定でこのOperation Idを自動生成することができます。

source: The https://tools.ietf.org/html/rfc7519[JWT specification] defines various levels of security of JWTs that one can use. The {mp-jwt} specification requires that JWTs that are signed with the RSA-256 signature algorithm. This in turn requires a RSA public key pair. On the REST endpoint server side, you need to configure the location of the RSA public key to use to verify the JWT sent along with requests. The `mp.jwt.verify.publickey.location=publicKey.pem` setting configured previously expects that the public key is available on the classpath as `publicKey.pem`. To accomplish this, copy the following content to a `security-jwt-quickstart/src/main/resources/publicKey.pem` file.
ja_jp: https://tools.ietf.org/html/rfc7519[JWT 仕様] は、使用できる JWT のさまざまなレベルのセキュリティーを定義しています。{mp-jwt} 仕様では、RSA-256 署名アルゴリズムで署名された JWT が必要です。これには、RSA 公開鍵ペアが必要です。REST エンドポイントサーバー側では、リクエストとともに送信された JWT を検証するために使用する RSA 公開鍵の場所を設定する必要があります。以前に設定され た`mp.jwt.verify.publickey.location=publicKey.pem` 設定は、公開鍵がクラスパスで `publicKey.pem` として使用可能であることを想定しています。これを行うには、次のコンテンツを `security-jwt-quickstart/src/main/resources/publicKey.pem` ファイルにコピーします。

source: The https://tools.ietf.org/html/rfc7519[JWT specification] defines various levels of security of JWTs that one can use. The {mp-jwt} specification requires that JWTs that are signed with the RSA-256 signature algorithm. This in turn requires an RSA public key pair. On the REST endpoint server side, you need to configure the location of the RSA public key to use to verify the JWT sent along with requests. The `mp.jwt.verify.publickey.location=publicKey.pem` setting configured previously expects that the public key is available on the classpath as `publicKey.pem`. To accomplish this, copy the following content to a `security-jwt-quickstart/src/main/resources/publicKey.pem` file.
ja_jp: https://tools.ietf.org/html/rfc7519[JWT 仕様] は、使用できる JWT のさまざまなレベルのセキュリティーを定義しています。{mp-jwt} 仕様では、RSA-256 署名アルゴリズムで署名された JWT が必要です。これには、RSA 公開鍵ペアが必要です。REST エンドポイントサーバー側では、リクエストとともに送信された JWT を検証するために使用する RSA 公開鍵の場所を設定する必要があります。以前に設定され た `mp.jwt.verify.publickey.location=publicKey.pem` 設定は、公開鍵がクラスパスで `publicKey.pem` として使用可能であることを想定しています。これを行うには、次のコンテンツを `security-jwt-quickstart/src/main/resources/publicKey.pem` ファイルにコピーします。

source: The https://tools.ietf.org/id/draft-kelly-json-hal-01.html[HAL] standard is a simple format to represent web links.
ja_jp: https://tools.ietf.org/id/draft-kelly-json-hal-01.html[HAL] 標準は、ウェブリンクを表現するためのシンプルなフォーマットです。

source: The https://try.redis.io/[interactive tutorial] introducing Redis.
ja_jp: Redis を紹介する https://try.redis.io/[インタラクティブなチュートリアル]。

source: The https://vertx.io/docs/vertx-core/java/#event_bus[Vert.x Event Bus] uses codecs to _serialize_ and _deserialize_ objects. Quarkus provides a default codec for local delivery. So you can exchange objects as follows:
ja_jp: link:https://vertx.io/docs/vertx-core/java/#event_bus[Vert.xイベントバス] では、コーデックを使用してオブジェクトの _シリアライズ_ と _デシリアライズ_ を行います。Quarkusでは、ローカル配信用のデフォルトのコーデックを提供しています。そのため、以下のようにオブジェクトを交換することができます。

source: The https://www.ietf.org/archive/id/draft-kelly-json-hal-11.html[HAL] standard is a simple format to represent web links.
ja_jp: https://www.ietf.org/archive/id/draft-kelly-json-hal-11.html[HAL] 標準は、Web リンクを表すシンプルなフォーマットです。

source: The idea behind Quarkus Virtual Thread support for Reactive Messaging is to offload the message processing on virtual threads, instead of running it on an event-loop thread or a worker thread.
ja_jp: Quarkus のリアクティブメッセージングにおける仮想スレッドのサポートは、メッセージ処理をイベントループスレッドまたはワーカースレッドで実行するのではなく、仮想スレッドにオフロードすることを目的としています。

source: The idea behind Quarkus Virtual Thread support for gRPC services is to offload the service method invocation on virtual threads, instead of running it on an event-loop thread or a worker thread.
ja_jp: Quarkus の gRPC サービスにおける仮想スレッドのサポートは、サービスメソッドの呼び出しをイベントループスレッドまたはワーカースレッドで実行するのではなく、仮想スレッドにオフロードすることを目的としています。

source: The idea behind the notion of the conditional dependency is that such a dependency must be activated only if a certain condition is satisfied. If the condition is not satisfied then the dependency **must not** be activated. In that regard, conditional dependencies can be categorized as optional, i.e. they may or may not appear in the resulting set of project dependencies.
ja_jp: 条件付き依存関係の概念の背後にある考え方は、そのような依存関係は、ある条件が満たされた場合にのみ有効化しなければならないということです。条件が満たされていない場合は、その依存関係を有効にして *はいけません* 。この点から、条件付き依存関係はオプションとして分類することができます。つまり、結果として得られるプロジェクト依存関係のセットに現れるかもしれないし、現れないかもしれません。

source: The idea is for multiple services to perform different computations/actions in concert, whilst retaining the option to compensate for any actions performed during the computation. This kind of loose coupling of services bridges the gap between strong consistency models such as JTA/XA and "home grown" ad hoc consistency solutions.
ja_jp: このアイデアは、複数のサービスが協調して異なる計算/アクションを実行する一方で、計算中に実行されたアクションを補正するオプションを保持するというものです。このようなサービスの緩やかな結合は、JTA/XAのような強力な一貫性モデルと、「自家製の」アドホックな一貫性ソリューションとの間のギャップを埋めるものです。

source: The idea is for multiple services to perform different computations/actions in concert, whilst retaining the option to compensate for any actions performed during the computation. This kind of loose coupling of services bridges the gap between strong consistency models such as JTA/XA and "home-grown" ad hoc consistency solutions.
ja_jp: このアイデアは、複数のサービスが協調して異なる計算/アクションを実行する一方で、計算中に実行されたアクションを補正するオプションを保持するというものです。このようなサービスの緩やかな結合は、JTA/XAのような強力な一貫性モデルと、「自家製の」アドホックな一貫性ソリューションとの間のギャップを埋めるものです。

source: The idea is that the extension auto-configures things for the user, eliminating a lot of boilerplate - we can just `@Inject` a `Tracer` wherever it is needed. Now imagine that in our application we would like to utilize the configured `Tracer`, but we need to customize it a little, for example by providing a custom `Reporter`. The only thing that would be needed in our application would be something like the following:
ja_jp: アイデアは、エクステンションがユーザーのために自動設定を行い、多くのボイラープレートを排除するということです。必要な場所であれば、 `@Inject` を `Tracer` にすることができます。私たちのアプリケーションで、設定された `Tracer` を利用しようとする場合は、、カスタムの `Reporter` を提供するなど、少しカスタマイズする必要があります。アプリケーションで必要になるのは、次のようなものだけです。
